# Задайте список из n чисел последовательности $(1+\frac 1 n)^n$ и выведите на экран их сумму.
# Пример:
# - Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}


digit = int(input("введите число: "))
arr = [round((1+1/i)**i, 3) 
for i in range(1, digit+1)]
print(round(sum(arr), 0))




